# CantileverLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionConcreteT..::..CantileverLength Property
StructuralSectionConcreteT Class See Also
---
Flange cantilever length.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double CantileverLength { get; set; }
```

Visual Basic
---
```text
Public Property CantileverLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CantileverLength {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionConcreteT Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace